users_ms/app/models/user.rb

  def self.getByEmail(email)
    self.where(email: email)[0]
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1  [["email", "darkwilde04@outlook.com"]]