users_ms/app/controllers/ldap_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    if params[:user].empty?
      error = {
        info: "User object not found or the value is empty",
        status: 400,
        message: "BAD REQUEST"
      }
      return render json: error, status: :bad_request
    end

    user = User.new(user_params)
    ldap = connect_admin

    if user.save and ldap != false